2018-04-04-restclient.el-+-elasticsearch.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://notes.neeasade.netrss.xml"
      title="RSS feed for https://notes.neeasade.net"/>
<title>restclient.el + elasticsearch</title>
<link href="assets/css/normalize.css" rel="stylesheet">
<link href="assets/css/sakura.css" rel="stylesheet">

</head>
<body>
<div id="preamble" class="status">
</div>
<div id="content">
<div class="post-date">04 Apr 2018</div><h1 class="post-title"><a href="2018-04-04-restclient.el-+-elasticsearch.html">restclient.el + elasticsearch</a></h1>
<p>
todo: and a screenshot of it in action
</p>

<p>
<code>restclient.el</code> is an emacs plugin that transforms a buffer into a
repl-like curl-backed experience (similar to kibana). It has support for
variables set with arbitrary elisp, turning it into a viable postman
replacement (with plain text! and versioning!). I find this to be a very
nice way to store and execute elasticsearch queries, but unfortunately
you lose autocomplete of ES specific items. Alternatively,
<a href="https://github.com/dakrone/es-mode">es-mode</a> exists, which is more ES specific but much more featureful.
</p>

<p>
Here is a starter point showing some of restclients capabilities and how
one might use it with elasticsearch:
</p>

<div class="org-src-container">
<pre class="src src-txt">;; -*- mode: restclient -*-

# local
:target = http://localhost:9200
:cloud-auth = ""
# Basic http auth example:
cloud-auth := (concat "Basic " (base64-encode-string "username:password"))
:prefix = some_prefix

# multiline variable
:headers = &lt;&lt;
content-type: application/json
Authorization: :cloud-auth
#

# note: there must be a comment to separate request definitions.

# list indices
GET :target/_cat/indices
:headers

# logs sorted by a field
GET :target/:prefix_log/_search
:headers
{
  "sort": [
    {
      "timestamp": {
	"order": "desc"
      }
    }
  ]
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<a href="archive.html"> Other posts </a></div>
</body>
</html>
